#include "step-procedures.h"

void Average()
{
	cout << "\n *Середнє арифметичне послідовності дійсних чисел з термінальним елементом*\n\n"
		<<"Введіть послідовність чисел, що закінчується нулем:\n";
	unsigned quantity = 0;
	double sum = 0.0;
	double a; cin >> a; // перший член послідовності
	while (a != 0.0)    // чи він не термінальний?
	{
		sum += a;       // накопичення суми та кількості
		++quantity;
		cin >> a;       // наступний член послідовності
	}
	if (quantity == 0) cout << "Послідовність починається нулем\n";
	else cout << "Середнє арифметичне = " << sum / quantity << '\n';
	return;
}